arribada/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
	DEBUG_ERROR("BMA400 [%s] Error %d: %s", api_name, rslt, msg);
	throw ErrorCode::I2C_COMMS_ERROR;
}


// ═══════════════════════════════════════════════════════
//  Power modes
// ═══════════════════════════════════════════════════════

/// @brief Enter SLEEP mode (~0.2 µA). NO engine runs in SLEEP — the
/// auto-wakeup engine needs LOW_POWER, GEN1 needs NORMAL. A sensor left here
/// is deaf until a mode change.
void BMA400LL::setup_sleep_mode() {
	int8_t rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
	check_result("set_power_mode(SLEEP)", rslt);
}

/// @brief Resting state after an on-demand reading. Every read used to end in
/// SLEEP unconditionally, which silently disarmed wake-on-motion: the very
/// first wake event's own sensor read put the chip to sleep, capping the whole
/// deployment at ONE motion interrupt per boot. When a wakeup handler is
/// armed, return to the mode its engine evaluates in — the WKUP/GEN1 config
/// registers persist across power-mode changes, so no reconfiguration is
/// needed.
void BMA400LL::rearm_or_sleep() {
	if (!m_wakeup_armed) {
		setup_sleep_mode();
		return;
	}
	int8_t rslt =
	    bma400_set_power_mode(m_power_mode == 0 ? BMA400_MODE_LOW_POWER : BMA400_MODE_NORMAL, &m_bma400_dev);
	check_result("set_power_mode(rearm)", rslt);
}

/// @brief NORMAL mode at 100 Hz — used for on-demand readings and calibration.
/// @note Named "active" to avoid confusion with the BMA400 LOW_POWER mode
///       which we don't use (NORMAL gives consistent readings with calibration).
void BMA400LL::setup_active_mode() {
	int8_t rslt;

	rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
	check_result("set_power_mode(NORMAL)", rslt);

	m_sensor_conf[0].type = BMA400_ACCEL;
	m_sensor_conf[0].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_2;
	m_sensor_conf[0].param.accel.odr = BMA400_ODR_100HZ;
	m_sensor_conf[0].param.accel.range = m_g_range;
	m_sensor_conf[0].param.accel.osr = BMA400_ACCEL_OSR_SETTING_0;

	rslt = bma400_set_sensor_conf(m_sensor_conf, 1, &m_bma400_dev);
	check_result("set_sensor_conf(active)", rslt);
}

/// @brief Enter NORMAL mode with GEN1 interrupt config for motion wakeup.
void BMA400LL::setup_normal_mode() {
	int8_t rslt;

	rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
	check_result("set_power_mode(NORMAL)", rslt);

	rslt = bma400_get_sensor_conf(m_sensor_conf, 1, &m_bma400_dev);
	check_result("get_sensor_conf", rslt);

	m_sensor_conf[0].type = BMA400_ACCEL;
	m_sensor_conf[0].param.accel.odr = BMA400_ODR_100HZ;
	m_sensor_conf[0].param.accel.range = m_g_range;
	m_sensor_conf[0].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_1;

	rslt = bma400_set_sensor_conf(m_sensor_conf, 1, &m_bma400_dev);
	check_result("set_sensor_conf(normal)", rslt);
}


// ═══════════════════════════════════════════════════════
//  Sensor reading
// ═══════════════════════════════════════════════════════

/// @brief Read calibrated XYZ + temperature.  Wakes from SLEEP, reads, returns to SLEEP.
void BMA400LL::read_xyz(double &x, double &y, double &z, int16_t &temperature) {
	SensorsPowerGuard power_guard;
	int8_t rslt;
	struct bma400_sensor_data data;
	uint8_t g_force = range_to_g(m_g_range);

	if (m_power_mode == 0)
		setup_active_mode();
	else
		setup_normal_mode();

	// Enable DRDY interrupt and wait for stabilization
	struct bma400_int_enable int_en = { .type = BMA400_DRDY_INT_EN, .conf = BMA400_ENABLE };
	rslt = bma400_enable_interrupt(&int_en, 1, &m_bma400_dev);
	check_result("enable_interrupt(DRDY)", rslt);

	// Clear any stale DRDY status from previous read, then wait for a FRESH sample
	uint16_t int_status = 0;
	int8_t __attribute__((unused)) clr = bma400_get_interrupt_status(&int_status, &m_bma400_dev);  // Clear stale
	PMU::delay_ms(20);  // Wait for new sample at ODR

	// Poll for fresh data ready with timeout
	bool data_ready = false;
	for (unsigned int i = 0; i < BMA400_DRDY_MAX_POLLS; i++) {
		rslt = bma400_get_interrupt_status(&int_status, &m_bma400_dev);
		if (int_status & BMA400_ASSERTED_DRDY_INT) {
			rslt = bma400_get_accel_data(BMA400_DATA_ONLY, &data, &m_bma400_dev);
			data_ready = true;
			break;
		}
		PMU::delay_ms(1);
	}
	if (!data_ready) {
		DEBUG_WARN("BMA400::read_xyz: DRDY timeout");
		rearm_or_sleep();
		return;
	}

	// Convert to g-force and apply calibration
	constexpr double G = 9.80665;
	double x_raw = lsb_to_ms2(data.x, g_force, 12) / G;
	double y_raw = lsb_to_ms2(data.y, g_force, 12) / G;
	double z_raw = lsb_to_ms2(data.z, g_force, 12) / G;

	x = x_raw - m_cal_x;
	y = y_raw - m_cal_y;
	z = z_raw - (m_cal_z - 1.0);

	DEBUG_INFO("BMA400: raw(%d|%d|%d) g(%.2f|%.2f|%.2f) cal(%.2f|%.2f|%.2f)", data.x, data.y, data.z, x_raw, y_raw,
	           z_raw, x, y, z);

	// Read temperature while sensor is in active mode (doesn't work in SLEEP)
	bma400_get_temperature_data(&temperature, &m_bma400_dev);

	rearm_or_sleep();
}

/// @brief Read temperature — requires sensor to be in active mode.
/// @note Caller must ensure the sensor is NOT in SLEEP mode before calling.
int16_t BMA400LL::read_temperature() {
	SensorsPowerGuard power_guard;
	// Briefly enter active mode to get a valid temperature reading
	setup_active_mode();
	PMU::delay_ms(12);  // Temperature conversion time ~11.2 ms

	int16_t temperature_data;
	bma400_get_temperature_data(&temperature_data, &m_bma400_dev);

	rearm_or_sleep();
	return temperature_data;
}


// ═══════════════════════════════════════════════════════
//  Configuration
// ═══════════════════════════════════════════════════════

void BMA400LL::set_wakeup_threshold(double threshold) {
	m_wakeup_threshold = threshold;
}
void BMA400LL::set_wakeup_duration(double duration) {
	m_wakeup_duration = duration;
}
void BMA400LL::set_range(unsigned int g_force) {
	m_g_range = static_cast<uint8_t>(g_force);
}

void BMA400LL::set_power_mode(unsigned int power_mode) {
	DEBUG_INFO("BMA400LL::set_power_mode: %u (%s wakeup)", power_mode, power_mode == 0 ? "LOW_POWER" : "NORMAL");
	m_power_mode = static_cast<uint8_t>(power_mode);
}

void BMA400LL::set_x_calibration(double x) {
	m_cal_x = x;
}
void BMA400LL::set_y_calibration(double y) {
	m_cal_y = y;
}
void BMA400LL::set_z_calibration(double z) {
	m_cal_z = z;
}


// ═══════════════════════════════════════════════════════
//  Calibration
// ═══════════════════════════════════════════════════════

