arribada/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
	m_irq.enable([this, func]() {
		if (!m_irq_pending) {
			m_irq_pending = true;
			func();
		}
	});
}

/// @brief Disable wakeup interrupt, return to SLEEP mode.
void BMA400LL::disable_wakeup() {
	SensorsPowerGuard power_guard;
	int8_t rslt;

	m_wakeup_armed = false;  // before the mode change, so nothing re-arms
	m_irq.disable();

	rslt = bma400_set_power_mode(BMA400_MODE_SLEEP, &m_bma400_dev);
	check_result("disable_wakeup: set_power_mode", rslt);

	// Disarm the engine that enable_wakeup actually armed for this mode.
	m_int_enable.type = (m_power_mode == 0) ? BMA400_AUTO_WAKEUP_EN : BMA400_GEN1_INT_EN;
	m_int_enable.conf = BMA400_DISABLE;
	rslt = bma400_enable_interrupt(&m_int_enable, 1, &m_bma400_dev);
	check_result("disable_wakeup: disable_interrupt", rslt);

	DEBUG_INFO("BMA400::disable_wakeup complete");
}

/// @brief Atomically check and clear the wakeup IRQ pending flag.
bool BMA400LL::check_and_clear_wakeup() {
	InterruptLock lock;
	bool value = m_irq_pending;
	m_irq_pending = false;
	return value;
}


// ═══════════════════════════════════════════════════════
//  FIFO batch reading
// ═══════════════════════════════════════════════════════

/// @brief Enable hardware FIFO in stream mode at the given ODR.
/// @note Caller must ensure VSENSORS is ON (no local SensorsPowerGuard here —
///       the FIFO needs power to persist between calls).
void BMA400LL::enable_fifo(uint8_t odr) {
	int8_t rslt;

	// Enter NORMAL mode with requested ODR
	rslt = bma400_set_power_mode(BMA400_MODE_NORMAL, &m_bma400_dev);
	check_result("enable_fifo: set_power_mode", rslt);

	m_sensor_conf[0].type = BMA400_ACCEL;
	m_sensor_conf[0].param.accel.odr = odr;
	m_sensor_conf[0].param.accel.range = m_g_range;
	m_sensor_conf[0].param.accel.data_src = BMA400_DATA_SRC_ACCEL_FILT_2;
	m_sensor_conf[0].param.accel.osr = BMA400_ACCEL_OSR_SETTING_0;
	rslt = bma400_set_sensor_conf(m_sensor_conf, 1, &m_bma400_dev);
	check_result("enable_fifo: set_sensor_conf", rslt);

	// Configure FIFO via device conf: XYZ data enabled
	struct bma400_device_conf dev_conf = {};
	dev_conf.type = BMA400_FIFO_CONF;
	dev_conf.param.fifo_conf.conf_regs = BMA400_FIFO_X_EN | BMA400_FIFO_Y_EN | BMA400_FIFO_Z_EN;
	dev_conf.param.fifo_conf.conf_status = BMA400_ENABLE;
	rslt = bma400_set_device_conf(&dev_conf, 1, &m_bma400_dev);
	check_result("enable_fifo: set_device_conf", rslt);

	// Flush any stale data
	bma400_set_fifo_flush(&m_bma400_dev);

	m_fifo_enabled = true;
	DEBUG_INFO("BMA400: FIFO enabled (ODR=%u, range=%uG)", odr, range_to_g(m_g_range));
}

/// @brief Disable FIFO, return to SLEEP mode.
/// @note Caller releases VSENSORS after this call.
void BMA400LL::disable_fifo() {
	struct bma400_device_conf dev_conf = {};
	dev_conf.type = BMA400_FIFO_CONF;
	dev_conf.param.fifo_conf.conf_status = BMA400_DISABLE;
	int8_t rslt = bma400_set_device_conf(&dev_conf, 1, &m_bma400_dev);
	if (rslt != BMA400_OK) DEBUG_WARN("BMA400: disable_fifo set_device_conf failed: %d", rslt);

	setup_sleep_mode();
	m_fifo_enabled = false;
	DEBUG_INFO("BMA400: FIFO disabled");
}

/// @brief Read and parse all available FIFO frames into the output array.
/// @return Number of samples read (0 if empty or error).
/// @note Caller must ensure VSENSORS is ON.
unsigned int BMA400LL::read_fifo(BMA400FifoSample *samples, unsigned int max_samples) {
	if (!m_fifo_enabled || !samples || max_samples == 0) return 0;

	// Read raw FIFO data (1024 bytes max + overhead)
	static constexpr uint16_t FIFO_BUF_SIZE = 1028;
	uint8_t fifo_buffer[FIFO_BUF_SIZE];

	struct bma400_fifo_data fifo_data = {};
	fifo_data.data = fifo_buffer;
	fifo_data.length = FIFO_BUF_SIZE;

	int8_t rslt = bma400_get_fifo_data(&fifo_data, &m_bma400_dev);
	if (rslt != BMA400_OK) {
		DEBUG_WARN("BMA400: FIFO read failed (%d)", rslt);
		return 0;
	}

	// Parse frames — use Bosch's bma400_fifo_sensor_data struct
	static constexpr uint16_t MAX_FRAMES = 170;  // 1024 / 6
	struct bma400_fifo_sensor_data accel_data[MAX_FRAMES];
	uint16_t frame_count = std::min<uint16_t>(max_samples, MAX_FRAMES);

	rslt = bma400_extract_accel(&fifo_data, accel_data, &frame_count, &m_bma400_dev);
	if (rslt != BMA400_OK) {
		DEBUG_WARN("BMA400: FIFO extract failed (%d)", rslt);
		return 0;
	}

	for (uint16_t i = 0; i < frame_count; i++) {
		samples[i].x = accel_data[i].x;
		samples[i].y = accel_data[i].y;
		samples[i].z = accel_data[i].z;
	}

	return frame_count;
}


// ═══════════════════════════════════════════════════════
//  BMA400 high-level Sensor class
// ═══════════════════════════════════════════════════════

BMA400::BMA400()
    : Sensor("AXL"),
      m_bma400(BMA400LL(BMA400_DEVICE, BMA400_ADDRESS, BMA400_WAKEUP_PIN)),
      m_cal(Calibration("AXL")) {
	if (configuration_store) {
		unsigned int g_range = configuration_store->read_param<unsigned int>(ParamID::AXL_SENSOR_MEASUREMENT_RANGE);
		unsigned int power_mode = configuration_store->read_param<unsigned int>(ParamID::AXL_SENSOR_POWER_MODE);
		m_bma400.set_range(g_range);
		m_bma400.set_power_mode(power_mode);

		m_fifo_enabled = configuration_store->read_param<bool>(ParamID::AXL_FIFO_ENABLE);
		m_fifo_sample_count = configuration_store->read_param<unsigned int>(ParamID::AXL_FIFO_SAMPLE_COUNT);
		if (m_fifo_sample_count == 0 || m_fifo_sample_count > 170) m_fifo_sample_count = 50;

		DEBUG_INFO("BMA400: config g_range=%u power_mode=%u fifo=%u samples=%u", g_range, power_mode, m_fifo_enabled,
		           m_fifo_sample_count);
	}

	load_calibration();
}

/// @brief Load X/Y/Z calibration from persistent file.  Falls back to defaults (0, 0, 1g).
void BMA400::load_calibration() {
	try {
		double x = m_cal.read(static_cast<unsigned int>(CalibrationPoint::X));
		double y = m_cal.read(static_cast<unsigned int>(CalibrationPoint::Y));
		double z = m_cal.read(static_cast<unsigned int>(CalibrationPoint::Z));
		m_bma400.set_x_calibration(x);
		m_bma400.set_y_calibration(y);
		m_bma400.set_z_calibration(z);
		DEBUG_INFO("BMA400: calibration loaded X=%.4f Y=%.4f Z=%.4f g", x, y, z);
	} catch (...) {
		m_bma400.set_x_calibration(0.0);
		m_bma400.set_y_calibration(0.0);
		m_bma400.set_z_calibration(1.0);
		DEBUG_INFO("BMA400: using default calibration X=0 Y=0 Z=1 g");
	}
}

/// @brief Read sensor value by channel.  Channel 1 triggers a new XYZ reading (single or FIFO batch).
double BMA400::read(unsigned int offset) {
	switch (offset) {
	case 0: return static_cast<double>(m_last_temperature) / 10.0;
	case 1:
		// Channel 1 triggers a new reading — single sample or FIFO batch
		if (m_fifo_enabled)
			read_fifo_batch();
		else
			m_bma400.read_xyz(m_last_x, m_last_y, m_last_z, m_last_temperature);
		return m_last_x;
	case 2: return m_last_y;
	case 3: return m_last_z;
	case 4: return compute_activity();
	case 5: return static_cast<double>(m_bma400.check_and_clear_wakeup());
	default: return 0.0;
	}
}

