arribada/linkit-v4-core/ports/nrf52840/core/hardware/bma400/bma400.cpp
/// @brief Read a FIFO batch, average the samples, apply calibration.
///
/// On first call, enables the FIFO at 100 Hz.  Subsequent calls read
/// whatever has accumulated since the last read.  If fewer than
/// m_fifo_sample_count are available, uses what's there (minimum 1).
/// Falls back to single-sample read_xyz() if FIFO read returns 0.
void BMA400::read_fifo_batch() {
	// Start FIFO on first read — keep VSENSORS ON for the entire FIFO session
	if (!m_fifo_started) {
		GPIOPins::acquire_sensors_pwr();  // Hold VSENSORS ON until FIFO disabled
		m_bma400.enable_fifo(BMA400_ODR_100HZ);
		m_fifo_started = true;
		// Wait for samples to accumulate (sample_count / 100 Hz)
		unsigned int wait_ms = (m_fifo_sample_count * 10) + 50;  // +50 ms margin
		PMU::delay_ms(wait_ms);
	}

	BMA400FifoSample samples[170];
	unsigned int count = m_bma400.read_fifo(samples, m_fifo_sample_count);

	if (count == 0) {
		// FIFO empty or error — fallback to single sample
		DEBUG_WARN("BMA400: FIFO empty, fallback to single read");
		m_bma400.read_xyz(m_last_x, m_last_y, m_last_z, m_last_temperature);
		return;
	}

	// Average raw samples then convert to g + apply calibration
	double sum_x = 0, sum_y = 0, sum_z = 0;
	for (unsigned int i = 0; i < count; i++) {
		sum_x += m_bma400.lsb_to_g(samples[i].x);
		sum_y += m_bma400.lsb_to_g(samples[i].y);
		sum_z += m_bma400.lsb_to_g(samples[i].z);
	}

	double avg_x = sum_x / count;
	double avg_y = sum_y / count;
	double avg_z = sum_z / count;

	// Apply calibration (same as read_xyz)
	m_last_x = avg_x - m_bma400.get_x_calibration();
	m_last_y = avg_y - m_bma400.get_y_calibration();
	m_last_z = avg_z - (m_bma400.get_z_calibration() - 1.0);

	// Skip temperature read during FIFO — read_temperature() puts BMA400
	// into sleep mode which kills the FIFO. Temperature from last single
	// read or init is still valid (BMA400 die temp changes slowly).

	DEBUG_INFO("BMA400: FIFO batch %u samples avg(%.3f|%.3f|%.3f) g", count, m_last_x, m_last_y, m_last_z);
}

/// @brief Compute activity metric: deviation from 1g (rest) scaled to 0-255.
double BMA400::compute_activity() {
	double g_mag = std::sqrt(m_last_x * m_last_x + m_last_y * m_last_y + m_last_z * m_last_z);
	double activity_g = std::abs(g_mag - 1.0);

	uint8_t g_range = m_bma400.range_to_g(m_bma400.get_range());
	double max_dev = std::max(1.0, static_cast<double>(g_range) - 1.0);

	if (activity_g > max_dev) activity_g = max_dev;
	m_last_activity = static_cast<uint8_t>((activity_g / max_dev) * 255.0);
	return static_cast<double>(m_last_activity);
}

/// @brief Write calibration value or trigger action (see SCALW offset table in .hpp).
void BMA400::calibration_write(const double value, const unsigned int offset) {
	DEBUG_TRACE("BMA400::calibration_write: value=%.2f offset=%u", value, offset);

	switch (offset) {
	case 0:
		m_bma400.set_x_calibration(value);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::X), value);
		break;
	case 1:
		m_bma400.set_y_calibration(value);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::Y), value);
		break;
	case 2:
		m_bma400.set_z_calibration(value);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::Z), value);
		break;
	case 3: {
		double ox, oy, oz;
		m_bma400.calibrate_offset(m_bma400.get_range(), ox, oy, oz);
		m_bma400.set_x_calibration(ox);
		m_bma400.set_y_calibration(oy);
		m_bma400.set_z_calibration(oz);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::X), ox);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::Y), oy);
		m_cal.write(static_cast<unsigned int>(CalibrationPoint::Z), oz);
		DEBUG_INFO("BMA400: auto-calibrated X=%.4f Y=%.4f Z=%.4f g", ox, oy, oz);
		break;
	}
	case 4:
		m_bma400.read_xyz(m_last_x, m_last_y, m_last_z, m_last_temperature);
		DEBUG_INFO("BMA400: calibrated X=%.4f Y=%.4f Z=%.4f g", m_last_x, m_last_y, m_last_z);
		break;
	case 5:
		DEBUG_INFO("BMA400: cal coeff X=%.4f Y=%.4f Z=%.4f g", m_bma400.get_x_calibration(),
		           m_bma400.get_y_calibration(), m_bma400.get_z_calibration());
		break;
	case 6:
		m_cal.save();
		DEBUG_INFO("BMA400: calibration saved");
		break;
	case 7: m_bma400.set_wakeup_threshold(value); break;
	case 8: m_bma400.set_wakeup_duration(value); break;
	case 9: m_bma400.set_range(static_cast<unsigned int>(value)); break;
	case 10: m_bma400.set_power_mode(static_cast<unsigned int>(value)); break;
	default: DEBUG_WARN("BMA400: invalid calibration_write offset %u", offset); break;
	}
}

/// @brief Read calibrated sensor value or configuration by offset (see SCALR table in .hpp).
void BMA400::calibration_read(double &value, const unsigned int offset) {
	if (offset >= 1 && offset <= 3) m_bma400.read_xyz(m_last_x, m_last_y, m_last_z, m_last_temperature);

	switch (offset) {
	case 1: value = m_last_x; break;
	case 2: value = m_last_y; break;
	case 3: value = m_last_z; break;
	case 4: value = m_bma400.get_x_calibration(); break;
	case 5: value = m_bma400.get_y_calibration(); break;
	case 6: value = m_bma400.get_z_calibration(); break;
	case 7: value = m_bma400.get_wakeup_threshold(); break;
	case 8: value = m_bma400.get_wakeup_duration(); break;
	case 9: value = static_cast<double>(m_bma400.get_range()); break;
	case 10: value = static_cast<double>(m_bma400.get_power_mode()); break;
	default:
		value = 0.0;
		DEBUG_WARN("BMA400: invalid calibration_read offset %u", offset);
		break;
	}

	DEBUG_INFO("BMA400::calibration_read: offset=%u value=%.4f", offset, value);
}

/// @brief Register wakeup motion interrupt handler on the BMA400.
void BMA400::install_event_handler(unsigned int, std::function<void()> handler) {
	m_bma400.enable_wakeup(handler);
}

/// @brief Unregister wakeup handler, stop FIFO if running, return to SLEEP.
void BMA400::remove_event_handler(unsigned int) {
	m_bma400.disable_wakeup();
	if (m_fifo_started) {
		m_bma400.disable_fifo();
		m_fifo_started = false;
		GPIOPins::release_sensors_pwr();  // Release VSENSORS held since FIFO start
	}
}

/// @brief Persist calibration offsets to flash (AXL.CAL file).
void BMA400::calibration_save(bool force) {
	m_cal.save(force);
}
